app/controllers/medical_treatments_controller.rb

SELECT "medical_treatments".* FROM "medical_treatments"
---
  def index
    @medical_treatments = MedicalTreatment.all;