app/controllers/messages_controller.rb

  def create
    @message = Message.create!(message_params)
---
INSERT INTO "messages" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "First message :D"], ["created_at", "2021-04-16 05:20:17.697976"], ["updated_at", "2021-04-16 05:20:17.697976"]]