app/controllers/working_hours_tables_controller.rb

  def index
    @working_hours_tables = WorkingHoursTable.all;
---
SELECT "working_hours_tables".* FROM "working_hours_tables"

  def create
    p @working_hours_table
    if @working_hours_table
      json_response({"detail": "table already created for this user"}, :forbidden)
    else
      @working_hours_table = current_user.build_working_hours_table(working_hours_table_params)
      if @working_hours_table.save
---
INSERT INTO "working_hours_tables" ("monday", "tuesday", "wednesday", "thursday", "friday", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @working_hours_table.update(working_hours_table_params)
---
UPDATE "working_hours_tables" SET "monday" = $1, "updated_at" = $2 WHERE "working_hours_tables"."id" = $3  [["monday", "7.00-11.00"], ["updated_at", "2021-05-01 09:08:31.141972"], ["id", 1]]

  def destroy
    @working_hours_table.destroy
---
DELETE FROM "working_hours_tables" WHERE "working_hours_tables"."id" = $1  [["id", 4]]